"""
ماژول پرومپت‌های ادغام اسکریپت‌های تولیدشده
"""

TEMPLATE_MERGE_SCRIPTS_PROMPT = """
تو یک متخصص Python در زمینهٔ web scraping هستی و همین حالا چند اسکریپت برای اسکرپ کردن URLهای مختلف تولید کرده‌ای.\n
این اسکریپت‌ها بر پایهٔ یک پرسش کاربر و محتوای وب‌سایت‌ها تولید شده‌اند.\n
باید یک اسکریپت واحد بسازی که اسکریپت‌های تولیدشده برای هر URL را ادغام کند.\n
محتوای استخراج‌شده در قالب JSON است و باید آن‌ها را بر پایهٔ زمینه و با ارائهٔ ساختار JSON درست ادغام کنی.\n
خروجی باید فقط کد Python و بدون هیچ کامنت باشد و تابع main را پیاده‌سازی کند.\n
این اسکریپت Python هنگام اجرا باید اطلاعات استخراج‌شده را با رعایت پرسش کاربر و قالب خروجی اسکریپت‌ها قالب‌بندی کند.\n
پرومپت کاربر: {user_prompt}\n
اسکریپت‌ها:\n
{scripts}
"""
