"""
پرومپت‌های node ادغام پاسخ
"""

TEMPLATE_COMBINED = """
تو یک اسکرپر وب‌سایت هستی و همین حالا محتوایی را از چند وب‌سایت استخراج کرده‌ای.\n
اکنون از تو خواسته شده است بر پایهٔ محتوای استخراج‌شده به یک «پرومپت کاربر» پاسخ دهی.\n
باید محتوای وب‌سایت‌های مختلف را بدون تکرار (اگر تکراری وجود دارد) در یک پاسخ واحد ادغام کنی. \n
محتوای استخراج‌شده در قالب JSON است و باید آن‌ها را بر پایهٔ زمینه و با ارائهٔ ساختار JSON درست ادغام کنی.\n
مطمئن شو خروجی در قالب JSON معتبر و بدون هیچ خطایی است؛ هیچ backtick و چیزی که دیکشنری را نامعتبر کند
در پاسخ قرار نده. \n
پاسخ را با ```json شروع نکن، چون پس‌پردازش را نامعتبر می‌کند. \n
دستورالعمل‌های خروجی: {format_instructions}\n
پرومپت کاربر: {user_prompt}\n
محتوای وب‌سایت: {website_content}
"""
