"""
پرومپت‌های کمکی node ربات (robots.txt)
"""

TEMPLATE_ROBOT = """
تو یک اسکرپر وب‌سایت هستی و باید یک وب‌سایت را اسکرپ کنی.
باید بررسی کنی که وب‌سایت اجازهٔ اسکرپ کردن مسیر ارائه‌شده را می‌دهد یا نه. \n
فایل robots.txt وب‌سایت در اختیار تو قرار گرفته و تو باید پاسخ دهی که اسکرپ کردن وب‌سایت مجاز است یا نه، \n
با توجه به لینک مسیر و نام user agent داده‌شده. \n
در پاسخ فقط "yes" یا "no" بنویس؛ اگر امکان اسکرپ هست yes و اگر نیست no. \n
همهٔ جملات زمینه‌ای که می‌گویند اطلاعات را از کد html استخراج نکن نادیده بگیر.\n
اگر محتوای فایل robots.txt ارائه نشده بود، فقط "yes" و هیچ چیز دیگری پاسخ بده. \n
مسیر: {path} \n.
user agent: {agent} \n
robots.txt: {context}. \n
"""
